export enum Steps {
  Uploading = 'UPLOADING',
  Overview = 'OVERVIEW',
  Processing = 'PROCESSING',
}
export enum WhileWorking {
  Cleaning = 'Cleaning',
  Hyp = 'Hyp',
  Done = 'Done',
}

export interface Work {
  id: number;
  img: string;
  fullName: string;
  born: string;
  died: string;
  titleName: string;
  writing: Writing;
}
export interface Writing {
  id: number;
  title: string;
  year: string;
  text: string;
}
export const data = [
  {
    id: 1,
    img: '../../../assets/images/authors/galaktion.jpg',
    fullName: 'გალაკტიონ ტაბიძე',
    born: 'დ. 17 ნოემბერი, 1892',
    died: 'მ. 17 მარტი, 1959',
    titleName: 'პოეტი',
    writing: [
      {
        id: 101,
        title: 'ლურჯა ცხენები',
        year: '1915წ.',
        text: `
        როგორც ნისლის ნამქერი, ჩამავალ მზით ნაფერი,
        ელვარებდა ნაპირი სამუდამო მხარეში!
        არ სჩანდა შენაპირი, ვერ ვნახე ვერაფერი,
        ცივ და მიუსაფარი მდუმარების გარეშე.
        
        მდუმარების გარეშე და სიცივის თარეშში,
        სამუდამო მხარეში მხოლოდ სიმწუხარეა!
        ცეცხლი არ კრთის თვალებში, წევხარ ცივ სამარეში,
        წევხარ ცივ სამარეში და არც სულს უხარია.
        
        შეშლილი სახეების ჩონჩხიანი ტყეებით
        უსულდგმულო დღეები რბიან, მიიჩქარიან!
        სიზმარიან ჩვენებით - ჩემი ლურჯა ცხენებით
        ჩემთან მოესვენებით! ყველანი აქ არიან!
        
        იჩქარიან წამები, მე კი არ მენანება:
        ცრემლით არ ინამება სამუდამო ბალიში;
        გაქრა ვნება-წამება - როგორც ღამის ზმანება,
        ვით სულის ხმოვანება ლოცვის სიმხურვალეში.
        
        ვით ცეცხლის ხეტიალი, როგორც ბედის ტრიალი,
        ჩქარი გრგვინვა-გრიალით ქრიან ლურჯა ცხენები!
        ყვავილნი არ არიან, არც შვება-სიზმარია!
        ეხლა კი სამარეა შენი განსასვენები!
        
        რომელი სცნობს შენს სახეს, ან ვინ იტყვის შენს სახელს?
        ვინ გაიგებს შენს ძახილს, ძახილს ვინ დაიჯერებს?
        ვერავინ განუგეშებს საოცრების უბეში,
        სძინავთ ბნელ ხვეულებში გამოუცნობ ქიმერებს!
        
        მხოლოდ შუქთა კამარა ვერაფერმა დაფარა:
        მშრალ რიცხვების ამარა უდაბნოში ღელდება!
        შეშლილი სახეების ჩონჩხიანი ტყეებით
        უსულდგმულო დღეები ჩნდება და ქვესკნელდება.
        
        მხოლოდ ნისლის თარეშში, სამუდამო მხარეში,
        ზევით თუ სამარეში, წყევლით შენაჩვენები,
        როგორც ზღვის ხეტიალი, როგორც ბედის ტრიალი,
        ჩქარი გრგვინვა-გრიალით ქრიან ლურჯა ცხენები!`,
      },
    ],
  },
  {
    id: 2,
    img: '../../../assets/images/authors/Prince_Nikoloz_Baratashvili.jpg',
    fullName: 'ნიკოლოზ ბარათაშვილი',
    born: 'დ. 4 დეკემბერი, 1817',
    died: 'გ. 21 ოქტომბერი, 1845',
    titleName: 'პოეტი',
    writing: [
      {
        id: 102,
        title: 'ფიქრნი მტკვრის პირას',
        year: '1837წ.',
        text: `
        წარვედ წყალის პირს სევდიანი ფიქრთ გასართველად,
აქ ვეძიებდი ნაცნობს ადგილს განსასვენებლად;
აქ ლბილს მდელოზედ სანუგეშოდ ვინამე ცრემლით,
აქაც ყოველი არემარე იყო მოწყენით;
ნელად მოღელავს მოდუდუნე მტკვარი ანკარა
და მის ზვირთებში კრთის ლაჟვარდი ცისა კამარა.

იდაყვ-დაყრდნობილ ყურს უგდებ მე მისსა ჩხრიალსა
და თვალნი რბიან შორად, შორად, ცის დასავალსა!
ვინ იცის, მტკვარო, რას ბუტბუტებ, ვისთვის რას იტყვი?
მრავალ დროების მოწამე ხარ, მაგრამ ხარ უტყვი!..

არ ვიცი, ამ დროს ჩემს წინაშე ჩვენი ცხოვრება
რად იყო ფუჭი და მხოლოდა ამაოება?..
მაინც რა არის ჩვენი ყოფა — წუთისოფელი,
თუ არა ოდენ საწყაული აღუვსებელი?
ვინ არის იგი, ვის თვის გული ერთხელ აღევსოს,
და რაც მიეღოს ერთხელ ნატვრით, ისი ეკმაროს?

თვითონ მეფენიც უძლეველნი, რომელთ უმაღლეს
არც ვინღა არის, და წინაშე არც ვინ აღუდგეს,
რომელთ ხელთ ეპყრასთ უმაღლესი სოფლის დიდება,
შფოთვენ და დრტვინვენ და იტყვიან: «როდის იქნება,
ის სამეფოცა ჩვენი იყოს?» და აღიძვრიან
იმავ მიწისთვის, რაც დღეს თუ ხვალ თვითვე არიან!..

თუნდ კეთილ მეფე როდის არის მოსვენებული?
მისი სიცოცხლე: ზრუნვა, შრომა და ცდა ქებული;
მისი ფიქრია, თუ ვით უკეთ მან უპატრონოს
თავისს მამულსა, თვისთა შვილთა, რომ შემდგომსა დროს
არ მისცეს წყევით თვის სახელი შთამომავლობას!..
მაგრამ თუ ერთხელ უნდა სოფელს ბოლო მოეღოს,
მაშინ ვიღამ სთქვას მათი საქმე, ვინ სადღა იყოს?..

მაგრამ რადგანაც კაცნი გვქვიან — შვილნი სოფლისა,
უნდა კიდეცა მივდიოთ მას, გვესმას მშობლისა.

არც კაცი ვარგა, რომ ცოცხალი მკვდარსა ემსგავსოს,
იყოს სოფელში და სოფლისთვის არა იზრუნვოს!`,
      },
      {
        id: 103,
        title: 'ცისა ფერს, ლურჯსა ფერს..',
        year: '1841წ.',
        text: `ცისა ფერს, ლურჯსა ფერს,
        პირველად ქმნილსა ფერს
        და არ ამ ქვეყნიერს,
        სიყრმიდგან ვეტრფოდი.
        
        და ახლაც, როს სისხლი
        მაქვს გაციებული,
        ვფიცავ მე — არ ვეტრფო
        არ ოდეს ფერსა სხვას.
        
        თვალებში მშვენიერს
        ვეტრფი მე ცისა ფერს;
        მოსრული იგი ცით
        გამოკრთის სიამით.
        
        ფიქრი მე სანატრი
        მიმიწვევს ცისა ქედს,
        რომ ეშხით დამდნარი
        შევერთო ლურჯსა ფერს.
        
        მოვკვდები — ვერ ვნახავ
        ცრემლსა მე მშობლიურს, —
        მის ნაცვლად ცა ლურჯი
        დამაფრქვევს ცვარს ციურს!
        
        სამარეს ჩემსა, როს
        გარს ნისლი მოეცვას —
        იგიცა შესწიროს
        ციაგმან ლურჯსა ცას!.`,
      },
      {
        id: 104,
        title: 'ხმა იდუმალი',
        year: '1836წ.',
        text: `ვისი ხმა არის ეს საკვირველი?
        რად აქვს გულს ესე ჩუმი ნაღველი?
        რა ვსცან პირველად წუთისოფელი,
        დავშთე ადგილი, სადაცა წრფელი
        რბიოდა ნათლად დრო ყმაწვილობის
        სწორთა, თანზრდილთა, მეგობართ შორის, —
        მას აქეთ ხმა რამ თან სდევს ყოველთა
        ჩემთა ზრახვათა და საწადელთა!
        ცხადად თუ სიზმრად, მე იგი მარად
        სულ ერთსა მიწვრთნის გულისა ჭირად:
        “ეძიე, ყმაო, შენ მხვედრი შენი,
        ვინძლო იპოვო შენი საშვენი!”
        მაგრამ მე მხვედრსა ჩემსა ვერ ვჰპოვებ,
        და მით კაეშანს ვერღა ვიშორებ!
        ნუთუ ხმა ესე არს ხმა დევნისა
        შეუწყალისა სინიდისისა?
        მაგრამ მე ჩემში ვერ ვჰპოვებ ავსა,
        მისს საშფოთველოს და საქენჯნავსა.
        ანგელოზი ხარ, მფარველი ჩემი,
        ან თუ ეშმაკი, მაცთური ჩემი?
        ვინცა ხარ, მარქვი, რას მომისწავებ,
        სიცოცხლეს ჩემსა რას განუმზადებ?
        როს ვსცნა მე შენი საიდუმლობა,
        როს მხვდეს ამ სოფლად ჩემი წილობა?..`,
      },
    ],
  },
  {
    id: 3,
    img: '../../../assets/images/authors/terenti.jpg',
    fullName: 'ტერენტი გრანელი',
    born: 'დ. 25 ნოემბერი , 1897',
    died: 'გ. 10 ოქტომბერი, 1934',
    titleName: 'პოეტი',
    writing: [
      {
        id: 105,
        title: 'MEMENTO MORI',
        year: '1924წ.',
        text: `ახლა უფრო ხშირია შეცდომების დაშვება,
        ახლა მოდის ივნისი, ირგვლივ მწვანე მოლია.
        ჩემი წმინდა სახელი პოეზიას დარჩება,
        ჩემი გული და სისხლი - ეს “Memento mori”-ა.
        
        დღეს სამია ივნისის, მინდა იყოს ცამეტი,
        ჩემს გარშემო ციხეა - მწუხარების სავანე.
        რომ მდომოდა სიცოცხლე, სიკვდილს არ ვიწამებდი,
        მიწა არ იქნებოდა ჩემთვის შავი სამარე.
        
        სადღაც მთასთან იწვიმა, სადღაც მთაზე ბურია,
        ამნაირი ღიმილი უწინ მე არ ვიცოდი.
        ახლა მე ცას ვუცქერი, ცაზე ანთებულია
        ვარსკვლავები - სიმბოლო თეთრი მარადისობის.
        
        ახლა რა ვქნა არ ვიცი, მე როდესაც ასე ვარ,
        როცა სულს ეპარება აჩრდილები სიბერის.
        მე ძლიერი ტალანტი, ზეციური არსება,
        ჩემი ნაზი სამშობლო - ლაჟვარდები ცისფერი.
        
        რა ვქნა, შავი ღამეა, მძიმე და უსაშველო,
        მახსოვს ჩემი სოფელი, მისი ყრუ ადგილები.
        ახლა რაღაც სხვა მინდა, რაღაც სხვა, უსახელო,
        რომ დაღუპვა მომელის, ვიცი დანამდვილებით.
        
        ნელა გადის დღეები და ძნელია გარჩევა,
        მე, ძვირფასო, ვერ მოვალ, გზა შენამდე შორია.
        ჩემი გვარი: გრანელი - პოეზიას დარჩება,
        ჩემი გული და სისხლი - ეს ”MEMENTO MORI”-ა.`,
      },
    ],
  },
];
